# Importing neccesary libraries

In [2]:
pip install --upgrade mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\arvind\appdata\local\programs\python\python310\lib\site-packages (9.5.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 25.2 -> 25.3
[notice] To update, run: python.exe -m pip install --upgrade pip

In [3]:
pip install pymysql

Requirement already satisfied: pymysql in c:\users\arvind\appdata\local\programs\python\python310\lib\site-packages (1.1.2)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 25.2 -> 25.3
[notice] To update, run: python.exe -m pip install --upgrade pip

In [1]:
import pandas as pd
from sqlalchemy import create_engine
import pymysql

# Importing datasets
Importing datasets which contains the data regarding providers, recievers, claims and food listings of the food present

In [2]:
# Load your CSV
providers = pd.read_csv('providers_data.csv')
recievers = pd.read_csv('receivers_data.csv')
claims = pd.read_csv('claims_data.csv')
food_listings = pd.read_csv('food_listings_data.csv')

# Upload the data in MySQL

## Create Database
creating a common database in mysql to store all the data in a same place

In [ ]:
try:
    con = pymysql.connect(
        host="localhost",
        user="root",
        password="Arvind@2003",
        autocommit=True
    )
    cursor = con.cursor()
    cursor.execute("CREATE DATABASE IF NOT EXISTS Food_wastage_management;")
    print("‚úÖ Database created successfully!")

except Exception as e:
    print("‚ùå Error:", e)

‚úÖ Database created successfully!

In [30]:
mycursor=con.cursor()

In [5]:
mycursor.execute("SHOW DATABASES")
for x in mycursor:
    print(x)

NameError: name 'mycursor' is not defined

## Imporing all the data to the common database
providers, recievers, food_listings and claims data are imported and stored to a same database

In [40]:
import pandas as pd
from sqlalchemy import create_engine

# ‚úÖ 1. Connection engine (note the encoded @ ‚Üí %40)
engine = create_engine("mysql+pymysql://root:Arvind%402003@localhost/food_wastage_management")

# ‚úÖ 2. Dataset dictionary
datasets = {
    'Providers': 'providers_data.csv',
    'receivers': 'receivers_data.csv',
    'Claims': 'claims_data.csv',
    'food_listings': 'food_listings_data.csv'
}

# ‚úÖ 3. Upload loop
for table_name, file_path in datasets.items():
    try:
        df = pd.read_csv(file_path)
        df.to_sql(
            name=table_name,
            con=engine,
            if_exists='replace',
            index=False
        )
        print(f"‚úÖ Successfully uploaded '{file_path}' as table '{table_name}'")

    except Exception as e:
        print(f"‚ùå Error uploading {file_path}: {e}")

print("üéâ All datasets processed!")

‚úÖ Successfully uploaded 'providers_data.csv' as table 'Providers'
‚úÖ Successfully uploaded 'receivers_data.csv' as table 'receivers'
‚úÖ Successfully uploaded 'claims_data.csv' as table 'Claims'
‚úÖ Successfully uploaded 'food_listings_data.csv' as table 'food_listings'
üéâ All datasets processed!

C:\Users\Arvind\AppData\Local\Temp\ipykernel_21036\493073761.py:19: UserWarning: The provided table name 'Providers' is not found exactly as such in the database after writing the table, possibly due to case sensitivity issues. Consider using lower case table names.
  df.to_sql(
C:\Users\Arvind\AppData\Local\Temp\ipykernel_21036\493073761.py:19: UserWarning: The provided table name 'Claims' is not found exactly as such in the database after writing the table, possibly due to case sensitivity issues. Consider using lower case table names.
  df.to_sql(

# Data analysis

## Food Providers & Receivers

1) How many food providers and receivers are there in each city?

In [7]:
# ‚úÖ 1. Connection engine (note the encoded @ ‚Üí %40)
engine = create_engine("mysql+pymysql://root:Arvind%402003@localhost/food_wastage_management")

In [9]:
# ‚úÖ Queries (update table/column names to match your actual CSV headers)
query1 = "SELECT COUNT(Type) AS number_of_providers FROM providers;"
query2 = "SELECT COUNT(Type) AS number_of_receivers FROM receivers;"

# ‚úÖ Execute queries
result1 = pd.read_sql_query(query1, con=engine)
result2 = pd.read_sql_query(query2, con=engine)

# ‚úÖ Print results nicely
print("üìä Providers Count in each City:")
print(result1, "\n")

print("üìä Receivers Count in each City:")
print(result2)

üìä Providers Count in each City:
   number_of_providers
0                 1000

üìä Receivers Count in each City:
   number_of_receivers
0                 1000

2) Which type of food provider (restaurant, grocery store, etc.) contributes the most food?

In [49]:
query3 = "SELECT Type, count(Type) number_of_providers FROM providers group by Type order by number_of_providers desc"
result3 = pd.read_sql_query(query3, con=engine)
print('most contributing food provider:', result3['Type'][0])
result3

most contributing food provider: Supermarket

               Type  number_of_providers
0       Supermarket                  262
1     Grocery Store                  255
2        Restaurant                  246
3  Catering Service                  236
4                rt                    1

3) Which receivers have claimed the most food?

In [53]:
query = "SELECT Type, count(Type) number_of_recievers FROM receivers group by Type"
result4 = pd.read_sql_query(query, con=engine)
result4

         Type  number_of_recievers
0     Shelter                  246
1  Individual                  217
2         NGO                  274
3     Charity                  263

4) What is the contact information of food providers in a specific city?

In [59]:
query = "SELECT Address, Name, City, Contact FROM providers ORDER BY City;"
result5 = pd.read_sql_query(query, con=engine)
result5

,Address,Name,City,Contact
0,"064 Andrea Land Suite 946\nLake Melody, ME 49581",Ibarra LLC,Adambury,6703380260
1,"590 Michelle Brooks Apt. 406\nDanielburgh, TN ...",Lozano-Miller,Adamsview,001-281-026-8022
2,"88279 Luis Throughway Apt. 639\nThomasberg, NM...",Davis Ltd,Adamsville,(112)122-3591x558
3,"304 Leslie Key\nMiddletonfurt, IN 01285",Rowe-Chen,Aguirreville,8228891240
4,Unit 2168 Box 9786\nDPO AA 06880,Galloway-Henderson,Alexanderchester,001-867-928-0212x3211
...,...,...,...,...
995,"6559 Matthew Turnpike\nJohnsonchester, AK 98520",Frederick LLC,Yatesside,784.860.0232x137
996,"560 Diane Place\nNorth Carla, SC 62821","Obrien, King and Robinson",Youngchester,+1-513-264-8229x419
997,dert,wer,yu,678654
998,"5591 Kathleen Route Apt. 687\nSouth Paul, NC 6...",Larson and Sons,Zimmermanton,152.836.4864
999,"0998 Mcintyre Row Apt. 105\nNorth Crystal, KY ...","Barnes, Castro and Curtis",Zimmermanville,507.577.7566

## Food Listings

5) What is the total quantity of food available from all providers?

In [64]:
query = """
SELECT Provider_Type, SUM(Quantity) AS Total_Quantity
FROM food_listings
GROUP BY Provider_Type;
"""
result6 = pd.read_sql_query(query, con=engine)
result6

      Provider_Type  Total_Quantity
0     Grocery Store          6059.0
1  Catering Service          6116.0
2        Restaurant          6923.0
3       Supermarket          6696.0

6) Which city has the highest number of food listings?

In [65]:
query = "SELECT Location as City, count(Food_Name) food_list FROM food_listings group by Location order by food_list desc"
result7 = pd.read_sql_query(query, con=engine)
result7

                     City  food_list
0               New Carol          6
1           South Kathryn          6
2               Jimmyberg          5
3               Perezport          5
4             East Angela          5
..                    ...        ...
619        Lake Coryhaven          1
620  Port Daniellechester          1
621         Andersonmouth          1
622             New Billy          1
623           Charlesview          1

[624 rows x 2 columns]

7) What are the most commonly available food types?

In [71]:
query = """
SELECT food_name, COUNT(food_name) AS avail_food_count
FROM food_listings
GROUP BY food_name
ORDER BY avail_food_count DESC;
"""
result8 = pd.read_sql_query(query, con=engine)
result8

    food_name  avail_food_count
0        Rice               114
1        Soup               111
2       Salad               105
3       Dairy               103
4     Chicken               103
5       Pasta               102
6       Bread                98
7        Fish                92
8  Vegetables                91
9      Fruits                81

## Claims

8) How many food claims have been made for each food item?

In [72]:
# JOIN query to combine employee with their department names
query = """
SELECT
    t3.Food_Name,
    count(t2.Claim_ID) no_food_claims
FROM
    food_listings t3
JOIN
    claims t2
ON
    t2.Food_ID = t3.Food_ID
group by t3.Food_Name
order by no_food_claims desc
"""

# Run query
result11 = pd.read_sql_query(query, con=engine)
result11

    Food_Name  no_food_claims
0        Rice             122
1        Soup             114
2       Dairy             110
3        Fish             108
4       Salad             106
5     Chicken             102
6       Bread              94
7       Pasta              87
8  Vegetables              86
9      Fruits              71

9) Which provider has had the highest number of successful food claims?

In [79]:
query = """
SELECT 
    f.Provider_Type AS Provider,
    ROUND(AVG(IF(c.Status = 'Completed', 1, 0)), 2) AS average_completed_claims
FROM claims c
JOIN food_listings f ON c.Food_ID = f.Food_ID
GROUP BY f.Provider_Type
ORDER BY average_completed_claims DESC;
"""

result_df = pd.read_sql_query(query, con=engine)
result_df

           Provider  average_completed_claims
0     Grocery Store                      0.36
1        Restaurant                      0.35
2  Catering Service                      0.33
3       Supermarket                      0.33

10) How many food claims have been made for each food item?

In [81]:
query = "select Status, count(*) * 100.0 / (select count(*) from claims) as percentage from claims group by Status"
result10 = pd.read_sql_query(query, con=engine)
result10

      Status  percentage
0    Pending        32.5
1  Cancelled        33.6
2  Completed        33.9

11) What is the average quantity of food claimed per receiver?

In [90]:
query = "select 100.0 * count((case when Status = 'Completed' then 1 end)) / count(*) as avg_food_claimed_per_reciever from claims"
result13 = pd.read_sql_query(query, con=engine)
result13

   avg_food_claimed_per_reciever
0                           33.9

12) Which meal type (breakfast, lunch, dinner, snacks) is claimed the most?

In [91]:
# JOIN query to combine employee with their department names
query = """
SELECT
    t3.Meal_Type,
    count(t2.Status) as no_of_claims
FROM
    food_listings t3
JOIN
    claims t2
ON
    t2.Food_ID = t3.Food_ID
where t2.Status = 'Completed'
group by t3.Meal_Type
order by no_of_claims desc
"""

# Run query
result14 = pd.read_sql_query(query, con=engine)
result14

   Meal_Type  no_of_claims
0  Breakfast            95
1     Dinner            86
2      Lunch            84
3     Snacks            74

13. Which provider claimed the most?

In [92]:
query = "select Provider_Type as Provider, sum(Quantity) as total_food_provided from food_listings group by Provider_Type order by total_food_provided desc"
result15 = pd.read_sql_query(query, con=engine)
print("Meal Type Claimed The Most:", result15['Provider'][0])
result15

Meal Type Claimed The Most: Restaurant

           Provider  total_food_provided
0        Restaurant               6923.0
1       Supermarket               6696.0
2  Catering Service               6116.0
3     Grocery Store               6059.0

14. Food Listings That are Expiring soon

In [100]:
query = """
SELECT 
    Food_Name, 
    MIN(STR_TO_DATE(Expiry_Date, '%%m/%%d/%%Y')) AS Earliest_Expiry
FROM 
    food_listings
WHERE 
    Expiry_Date IS NOT NULL AND Expiry_Date <> ''
GROUP BY 
    Food_Name
ORDER BY 
    Earliest_Expiry ASC;
"""
result15 = pd.read_sql_query(query, con=engine)
result15

    Food_Name Earliest_Expiry
0       Bread      2025-03-16
1        Soup      2025-03-16
2      Fruits      2025-03-16
3  Vegetables      2025-03-16
4       Dairy      2025-03-16
5        Rice      2025-03-16
6       Pasta      2025-03-16
7       Salad      2025-03-16
8     Chicken      2025-03-16
9        Fish      2025-03-16

# My 5 Queries/observation

1) Percentage share of each reciever organisation recieving food

In [109]:
query = "select Type AS receiver_type,COUNT(*) * 100.0 / (SELECT COUNT(*) FROM receivers) AS percentage_share from receivers group by Type"
result17 = pd.read_sql_query(query, con=engine)
result17

  receiver_type  percentage_share
0       Shelter              24.6
1    Individual              21.7
2           NGO              27.4
3       Charity              26.3

In [110]:
query = "select Type AS provider_type,COUNT(*) * 100.0 / (SELECT COUNT(*) FROM providers) AS percentage_share from providers group by Type"
result18 = pd.read_sql_query(query, con=engine)
result18

      provider_type  percentage_share
0       Supermarket              26.2
1     Grocery Store              25.5
2        Restaurant              24.6
3  Catering Service              23.6
4                rt               0.1

In [111]:
query = '''
SELECT
    f.Meal_Type,
    CAST(SUM(CASE WHEN c.Status = 'Completed' THEN 1 ELSE 0 END) AS REAL) * 100 / (SELECT COUNT(*) FROM claims c where Status = 'Completed') as success_percentage
FROM
    claims c
JOIN
    food_listings f ON c.Food_ID = f.Food_ID
GROUP BY
    f.Meal_Type
ORDER BY success_percentage DESC;
'''

# Run query
result19 = pd.read_sql_query(query, con=engine)
result19

   Meal_Type  success_percentage
0  Breakfast           28.023599
1     Dinner           25.368732
2      Lunch           24.778761
3     Snacks           21.828909

In [112]:
# JOIN query to combine employee with their department names
query = """
SELECT
    f.Provider_Type,
    ROUND(SUM(CASE WHEN c.Status = 'Completed' THEN 1 ELSE 0 END) * 100.0 / COUNT(*), 2) AS success_rate
FROM
    food_listings f
JOIN
    claims c ON f.Food_ID = c.Food_ID
GROUP BY
    f.Provider_Type
ORDER BY
    success_rate DESC;
"""

# Run query
result20 = pd.read_sql_query(query, con=engine)
result20

      Provider_Type  success_rate
0     Grocery Store         35.63
1        Restaurant         34.63
2  Catering Service         32.79
3       Supermarket         32.54

In [113]:
query = "select Food_Type, COUNT(*) * 100.0 / (SELECT COUNT(*) FROM food_listings) AS food_type_percentage_share from food_listings group by Food_Type"
result21 = pd.read_sql_query(query, con=engine)
result21

        Food_Type  food_type_percentage_share
0  Non-Vegetarian                        33.0
1           Vegan                        33.4
2      Vegetarian                        33.6

In [114]:
query = "select Meal_Type, count(Food_Type) as count_vegan from food_listings where Food_type = 'Vegan' group by Meal_Type"
query1 = "select Meal_Type, count(Food_Type) as count_vegetarian from food_listings where Food_type = 'Vegetarian' group by Meal_Type"
query2 = "select Meal_Type, count(Food_Type) as count_non_veg from food_listings where Food_type = 'Non-Vegetarian' group by Meal_Type"
query_all = pd.merge(pd.merge(pd.read_sql_query(query, con=engine), pd.read_sql_query(query1, con=engine), on='Meal_Type', how='outer'), pd.read_sql_query(query2, con=engine), on='Meal_Type', how='outer')
df = query_all
df

   Meal_Type  count_vegan  count_vegetarian  count_non_veg
0  Breakfast           77                95             82
1     Dinner           74                95             76
2      Lunch           85                77             86
3     Snacks           98                69             86